{
  "url": "https://dynamicbusiness.com/featured/founder-friday/founder-friday-dev-chopra-reveals-the-highs-and-lows-of-raising-capital.html",
  "scrapedAt": "2025-01-30T02:50:48.456Z",
  "data": {
    "title": "Founder Friday: Dev Chopra reveals the highs and lows of raising capital",
    "publicationDate": "",
    "author": "Yajush Gupta",
    "paragraphs": [
      {
        "heading": {
          "level": 2,
          "text": "Aligning visions and finding the right investors"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "Approach fundraising as a sales cycle"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "Drawing on past experience and mentorship"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "The impact of age: A double-edged sword"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "Advice For aspiring founders on raising capital"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "What do you think?"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 4,
          "text": "Be the first to comment"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 4,
          "text": "Add a new comment"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "DB Brand Accounts"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "Why insurers should be all about the data"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "2025 Outlook: What SMEs need to know"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "Hiring overseas? Here’s how to keep your business covered"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "Seven loyalty program types: Pick the perfect fit"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "How to save on international business calling: 5 practical tips"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Dev Chopra, CEO and co-founder of DAPPA Fashion (On the right)",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Yajush Gupta",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "November 29, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Perhaps the most critical lesson our team has learned is to approach fundraising as we would any sales cycle. You aren’t selling the product; you’re selling the business. This means you’re selling your business model, long-term strategy, and vision.",
        "isBlockquote": true,
        "image": null
      },
      {
        "text": "Perhaps the most critical lesson our team has learned is to approach fundraising as we would any sales cycle. You aren’t selling the product; you’re selling the business. This means you’re selling your business model, long-term strategy, and vision.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Raising capital feels more like riding a rollercoaster than a simple business transaction—especially for Gen-Z founders who are out here rewriting the rules. In this week’s Founder Feature, we’re taking a behind-the-scenes look at Dev Chopra, the trailblazing CEO and co-founder of DAPPA Fashion, a cutting-edge generative AI fashion tech startup.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Balancing two of the most fast-moving industries—AI and fashion—Chopra has not only caught the attention of investors but has also tackled the wild ride of scaling a business from the ground up.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "From perfecting his pitch to securing game-changing investment, Chopra reveals the juicy insights he’s picked up along the way, sharing the secret sauce that helped turn his bold vision into a thriving business. So, grab your seatbelt and get ready for this week’s edition of Founder Friday, where we break down the highs, the lows, and all the lessons learned from a founder shaking up two industries at once.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Let’s face it—raising capital is never easy, especially when you’re a Gen-Z founder trying to prove that youth equals innovation. The tech world may be changing fast, but securing investor funding can still feel like a maze of uncertainty and tough breaks.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Chopra knows this struggle all too well. Fortunately, he and his team have been lucky enough to snag some serious backing from top Australian investors.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "“As one of a team of all Gen-Z founders of an AI-based fashion tech startup, I know this struggle firsthand. The path to funding wasn’t always straightforward or easy: we’ve had guidance from mentors and learnt many lessons along the way.”",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Here are five key takeaways from DAPPA Fashion’s adventure in raising capital that could help supercharge your own startup journey. Ready? Let’s dive in!",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "By following VCs’ publicly shared content, blog posts, and investment theses, we’ve been able to gauge a VC’s perspective on technology and market sectors. This proactive approach helps keep things more targeted",
        "isBlockquote": true,
        "image": null
      },
      {
        "text": "By following VCs’ publicly shared content, blog posts, and investment theses, we’ve been able to gauge a VC’s perspective on technology and market sectors. This proactive approach helps keep things more targeted",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Chopra says that The search for investors is as much about alignment as it is about funding.  “When approaching investors, we’ve always looked to find investors who share the same vision as us for DAPPA Fashion as a business. Beyond financial support, we’re seeking backers who believe in the potential of Australia’s emerging tech scene and its capacity for innovation. One way we identify these investors is by leveraging resources such as AirTree’s Open Source VC, which provides insights into different venture capital firms’ approaches and areas of interest.”",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "“Understanding what motivates a venture capital firm helps us select investors who are not only financially supportive but also philosophically aligned with their business vision. By following VCs’ publicly shared content, blog posts, and investment theses, we’ve been able to gauge a VC’s perspective on technology and market sectors. This proactive approach helps keep things more targeted and efficient on our end, ensuring we connect with investors who have a genuine interest in our mission.”",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Perhaps the most critical lesson Dev Chopra and his team at DAPPA Fashion have learned is to approach fundraising as they would any sales cycle. Instead of selling the product, they are selling the business itself—this means focusing on presenting their business model, long-term strategy, and overall vision to potential investors. “While product innovation is critical, it’s only part of the equation for investors who need assurance about the company’s commercial viability, market positioning, and long-term sustainability.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "“This shift in mindset has also required our team to develop new skills, often drawn from traditional sales techniques. We’ve had to learn how to get to the point quicker and be clear about our value proposition. Streamlining presentations and honing a pitch means we can communicate their ideas succinctly and effectively, an essential skill in a competitive fundraising environment. Targeting investors with a strong understanding of and belief in their sector allows us to move past introductory conversations and focus on the more substantial aspects of the business plan.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "“With some of Australia’s top investors already on board, they’re assisting us in raising further capital as DAPPA Fashion continues to develop its generative AI model for fashion and eCommerce.”",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Finding a mentor with prior experience in capital raising has been invaluable says Dev Chopra. “Finding a mentor with prior experience in capital raising is invaluable. We have been fortunate enough to draw on the experiences of a partner to help us with our own fundraising.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Their guidance has been instrumental in navigating the complexities of venture capital, helping the team develop practical knowledge of deal-making, negotiation, and investor relations. This mentorship really gave us a head start and continues to inform our capital decisions.”",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "For young founders like Dev Chopra, age can be both an asset and a challenge in the world of venture capital. On one hand, being part of Gen-Z has provided a fresh perspective, enabling Chopra and his team to identify unique gaps in the market that others may overlook. Their age has driven them to build the business and focus on addressing these untapped opportunities. “However, age has also presented challenges. Reputation and experience often hold significant weight for investors, and not yet having a proven track has meant that VCs, at times, have been resistant. To counter this we have needed to refine our approach.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "“Ultimately, investors are backing DAPPA based on their analysis of us as a team and our ability to execute – there are no other data points to inform their decision. This puts added pressure on us to prove our capability through strong business planning, strategic hires, and quick results.”",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Always be adaptable and willing to learn from each step of the journey – especially in the oft-unpredictable world of venture funding.",
        "isBlockquote": true,
        "image": null
      },
      {
        "text": "Always be adaptable and willing to learn from each step of the journey – especially in the oft-unpredictable world of venture funding.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Dev Chopra emphasizes the importance of persistence and learning from every experience. “It’s crucial to stay adaptable and willing to learn at each stage of the journey, especially in the unpredictable world of venture funding,” he explains. “Always be adaptable and willing to learn from each step of the journey – especially in the oft-unpredictable world of venture funding. Learning how to handle setbacks and continuously improve our approach to fundraising has been a defining part of our growth as entrepreneurs. Finding the right investors involves not only seeking financial backing but also building relationships with those who understand and support our vision.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "“By treating fundraising as an iterative process, we continue to refine our strategies, ensuring we remain agile, focused, and prepared for the next opportunity.”",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Keep up to date with our stories on LinkedIn, Twitter, Facebook and Instagram.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Yajush Gupta",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Yajush is a journalist at Dynamic Business. He previously worked with Reuters as a business correspondent and holds a postgrad degree in print journalism.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Auto insurance is evolving with digital tools like mobile apps, AI, and telematics, making it faster, fairer, and more convenient. What’s the future?",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "newgen",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "December 18, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "From inflation pressures to workforce adjustments, here’s what you need to know to keep your business on track.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Creditor Watch",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "December 17, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Want a Global Team Without the Risks? Here’s the Answer",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "GoGlobal",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "December 3, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Discover the seven primary types of loyalty programs and learn how to select the ideal one for your brand.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Marcus Marius",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "October 30, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "When you’re traveling for business, making international calls can quickly add up. But with a few smart strategies, you can stay connected without blowing your budget. Many business travelers unknowingly overspend on roaming fees and international call charges. The good news is that by using tools like mobile apps, local SIM cards, and international top-up […]",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Guest Author",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "October 17, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "You have reached the end!",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "About Us",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Dynamic Business has been helping business owners and managers for 27 years",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "© Copyrights 2020 by Dynamic Business - All rights reserved.",
        "isBlockquote": false,
        "image": null
      }
    ]
  }
}