{
  "url": "https://dynamicbusiness.com/topics/news/proven-business-expansion-strategies-from-4-successful-entrepreneurs.html",
  "scrapedAt": "2025-01-30T02:51:25.017Z",
  "data": {
    "title": "Proven business expansion strategies from 4 successful entrepreneurs",
    "publicationDate": "",
    "author": "Yajush Gupta",
    "paragraphs": [
      {
        "heading": {
          "level": 2,
          "text": "Invest for success"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "Diversify"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "Have a bank that backs you"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "Source the right people"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "What do you think?"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 4,
          "text": "Be the first to comment"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 4,
          "text": "Add a new comment"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 2,
          "text": "DB Brand Accounts"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "Why insurers should be all about the data"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "2025 Outlook: What SMEs need to know"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "Hiring overseas? Here’s how to keep your business covered"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "Seven loyalty program types: Pick the perfect fit"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "heading": {
          "level": 3,
          "text": "How to save on international business calling: 5 practical tips"
        },
        "text": "",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "via Pexels",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Yajush Gupta",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "January 27, 2025",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "What does it take to successfully grow a business? Four innovative NAB customers share their strategies for sustainable expansion.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Growth is the lifeblood of any business. It unlocks new markets, strengthens customer relationships, and drives revenue. But achieving long-term, sustainable growth requires careful planning, strategic investments, and the right support. Here’s how four NAB customers are making it happen. Hugos Chocolates, a NSW-based business, took a deliberate approach to growth. Founder Costa Konstantopoulos didn’t rush to scale his chocolate factory, especially since he had no prior experience in the industry. A former chemist, Costa acquired his chocolate-making equipment on a whim when purchasing a Homebush property in 2010. “I spent a lot of time mixing and matching and changing [my approach], trying to work out how to create something fun,” Costa says.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Fourteen years later, Hugos Chocolates employs up to 75 people and supplies products to brands like Woolworths and Aldi. Costa continues to innovate, dedicating time to developing complex, on-trend products, such as a pistachio-filled ball that took him three months to perfect. “We’ve been able to be nimble, and that’s what has really driven our growth,” Costa explains.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "None of this would be possible without considerable investment in equipment. “We’re constantly acquiring new machinery,” Costa explains. “That’s allowed us to follow trends where our competitors might not be able to.”",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "But it hasn’t just been about organic growth. More recently, the business acquired Fantales from Nestlé Australia and Smyth’s Confectionery, a 110-year-old confectionery company based in Adelaide. The benefit of these acquisitions, Costa says, is that it gives Hugos Chocolates a brand name that people have grown up with, making it easier to introduce new products.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Fawaz Khodary’s growth strategy has centred on acquisition too. Working together, he and his three brothers have built up Your Discount Chemist – a business that’s grown to 13 pharmacies over the years with two in Canberra, one in Sydney and the rest in regional NSW, mainly on the Mid North Coast.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Diversification has also been key, however, with the brothers launching a website in 2010 to augment their physical stores. “We wanted to broaden our customer base,” Fawaz says. “It’s still a small percentage, but the online business is growing faster than our pharmacies.” Further investment is helping. The brothers were operating from the back of a store and losing sales because of limited stock. They opened a new warehouse in Port Macquarie in 2023. “It was a big investment but now we have all the space and stock we need to keep up with demand, ” Fawaz says.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Access to finance has been critical for the growth strategy of national risk advisor McLardy McShane. Ten years ago, it was a traditional insurance broker based in Victoria employing about 20 people. Today, it has more than 400 people nationally. However, the firm’s existing debt structure was holding it back from fully achieving its expansion goals. As such, it was looking for a new banking partner to deliver on its long-term strategy. NAB quickly streamlined McLardy McShane’s loan agreements to put the firm in the best position to leverage the growth and momentum it had already established. “That helped us to focus on future growth of the business in a sustainable way,” says co-founder Don McLardy.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "It’s also helped that they’ve brought their people along with them. “We spend a lot of time and a lot of focus on our people,” COO Meg Long explains. More recently, the firm created two new positions, National Head of Culture and People and National Head of Events, to ensure there’s “cross-pollination”, as Long puts it, between their original, smaller Victorian team and their considerably larger national team. Such initiatives are working. “[At a time when it’s quite hard to keep good people,] we’re lucky to have a retention rate for staff nationally at around 96%,” Long says.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "People are at the heart of BG Private’s growth strategy as well. The accounting, audit and advisory firm is very aware of current labour shortages and sees growth as key to engaging and retaining staff. “One of the most important things [for your workers is] that they can see that there is a growth strategy in place,” says Managing Partner Eugene Smarrelli. This also benefits your customer base. “Clients are always demanding more services, better-quality services. For that, you need to maintain your expertise,” Eugene says.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "“Just relying on internal growth is not sufficient; you need to go out there and look for opportunities.”Landing the right opportunity, however, takes thorough due diligence to ensure the right cultural fit. This has been essential for BG Private, which has often acquired a firm plus its partner. Grabbing the right opportunity also requires you to line up your financing. “Your partners have to all be on board for the transactions that you are about to embark on, but the most important thing is having someone that can support you when you are ready to move,” Eugene says. “[For us, that’s NAB].”",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Source",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Keep up to date with our stories on LinkedIn, Twitter, Facebook and Instagram.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Yajush Gupta",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Yajush is a journalist at Dynamic Business. He previously worked with Reuters as a business correspondent and holds a postgrad degree in print journalism.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Auto insurance is evolving with digital tools like mobile apps, AI, and telematics, making it faster, fairer, and more convenient. What’s the future?",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "newgen",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "December 18, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "From inflation pressures to workforce adjustments, here’s what you need to know to keep your business on track.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Creditor Watch",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "December 17, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Want a Global Team Without the Risks? Here’s the Answer",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "GoGlobal",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "December 3, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Discover the seven primary types of loyalty programs and learn how to select the ideal one for your brand.",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Marcus Marius",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "October 30, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "When you’re traveling for business, making international calls can quickly add up. But with a few smart strategies, you can stay connected without blowing your budget. Many business travelers unknowingly overspend on roaming fees and international call charges. The good news is that by using tools like mobile apps, local SIM cards, and international top-up […]",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Guest Author",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "October 17, 2024",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "About Us",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "Dynamic Business has been helping business owners and managers for 27 years",
        "isBlockquote": false,
        "image": null
      },
      {
        "text": "© Copyrights 2020 by Dynamic Business - All rights reserved.",
        "isBlockquote": false,
        "image": null
      }
    ]
  }
}